[

"If you were a vegetable, which one would you be, and why would I be tempted to eat you? (this is not freaky)",
"If you could swap lives with one cartoon character for a day (we already know who it is) who would it be, and how would I embarrass you?",
"Would you rather fight a goose once every morning, or a bear once a year?",
"If we could switch bodies for 24 hours, what's the first thing you'd do as me?",
"If you could only communicate in animal sounds for one week, what animal would you choose?",
"If you had to eat one condiment with one meal for the rest of your life, what would it be? (don't say nothing :)",
"If you could be a household appliance, which one would you be and why?",
"If our relationship was a pizza topping, what would it be?",
"What fictional character do you absolutely think you could take in a fight?",
"Would you rather have fingers as long as legs or legs as short as fingers?",
"What's the most random object in your room right now, and what's its backstory?",
"If you could turn any everyday activity into an Olympic sport, what do you think you'd do well at? (I might already know the answer to this)",
"What's a weird food combination that you enjoy?",
"If you had to live inside one tv show universe, what would you pick and why?",
"If we adopted a pet dinosaur, what would we name it?",
"Would you rather be able to achieve all of your fitness goals with one workout per week, or be able to read absurdly fast?",
"Would you rather sing every word or dance every step for a day?",
"If you could instantly master one skill, what would it be?",
"Would you rather experience the beginning of the world or the end?",
"Would you rather have everything you draw become real (but be terrible at drawing) or be able to fly, but only as fast as you can walk?",
"If you could make one thing illegal, what would it be?",
"If a turtle doesn't have a shell, is it homeless or naked?",
"If you put a chameleon on a mirror, what color would it turn?",
"If you try to fail, and succeed, which one did you do?",
"If humans can't see air, can fish see water?",
"If milo could roast me, how do you think he would do it?",
"Would you rather have the ability to see 10 minutes into the future or 150 years into the future?",
"If extra lives were a thing in the real world, how would you get them?",
"If you had to pick a historical era to live in, what would it be and why?",
"If you could make a piece of clothing that had any kind of power, what kind of power would it have and how would that benefit you personally?",
"What do you believe is the most important invention in history? Why?",
"If you were a tree for one day, what kind of tree would you want to be?",
"If you were trapped on a desert island and could only bring three things, what would they be?",
"If you were able to throw a party and money wasn’t an issue, what kind of party would you throw?",
"What would you do if you were walking in the forest and saw a wolf? (I live in fear of the answer I am about to recieve).",
"Crunchy peanut butter or smooth? (there is only one correct answer).",
"What proportion of the verbs you know would you be willing to never use again if you could know all the nouns? (don't ask me what this question is











