[
"If you were a vegetable, which one would you be, and why would I be tempted to eat you? (this is not freaky; don't talk about it)",
"If you could swap lives with one cartoon character for a day (we already know who it is) who would it be, and how would I embarrass you?",
"Would you rather fight a goose once every morning, or a bear once a year?",
"If we could switch bodies for 24 hours, what's the first thing you'd do as me? (don't say 'stack donuts on it')",
"If you could only communicate in animal sounds for one week, what animal would you choose?",
"If you had to eat one condiment with one meal for the rest of your life, what would it be? (don't say nothing :)",
"If you could be a household appliance, which one would you be and why?",
"If our relationship was a pizza topping, what would it be?",
"What fictional character do you absolutely think you could take in a fight?",
"Would you rather have fingers as long as legs or legs as short as fingers?",
"What's the most random object in your room right now, and what's its backstory?",
"If you could turn any everyday activity into an Olympic sport, what do you think you'd do well at? (I might already know the answer to this)",
"What's a weird food combination that you enjoy?",
"If you had to live inside one tv show universe, what would you pick and why?",
"If we adopted a pet dinosaur, what would we name it?",
"Would you rather be able to achieve all of your fitness goals with one workout per week, or be able to read absurdly fast?",
"Would you rather sing every word or dance every step for a day?",
"If you could instantly master one skill, what would it be? (this is different than the language question.",
"Would you rather experience the beginning of the world or the end?",
"Would you rather have everything you draw become real (but be terrible at drawing) or be able to fly, but only as fast as you can walk?",
"If you could make one thing illegal, what would it be?",
"If a turtle doesn't have a shell, is it homeless or naked?",
"If you put a chameleon on a mirror, what color would it turn?",
"If you try to fail, and succeed, which one did you do?",
"If humans can't see air, can fish see water?",
"If milo could roast me, how do you think he would do it?",
"Would you rather have the ability to see 10 minutes into the future or 150 years into the future?",
"If extra lives were a thing in the real world, how would you get them?",
"If you had to pick a historical era to live in, what would it be and why?",
"If you could make a piece of clothing that had any kind of power, what kind of power would it have and how would that benefit you personally?",
"What do you believe is the most important invention in history?- i'm choosing joshua patrick allen",
"If you were a tree for one day, what kind of tree would you want to be?",
"If you were trapped on a desert island and could only bring three things, what would they be?",
"If you were able to throw a party and money wasn’t an issue, what kind of party would you throw?",
"What would you do if you were walking in the forest and saw a wolf? (I live in fear of the answer I am about to recieve).",
"Crunchy peanut butter or smooth? (there is only one correct answer).",
"What proportion of the verbs you know would you be willing to never use again if you could know all the nouns? (don't ask me what this question is).",
"Would you take $10 million, but there's a snail that's trying to get you (forever)- you can't ever be touched by the snail, otherwise you'll die.",
"If a train was headed straight toward five people, and there was a lever... (the classic)",
"What happens when the unstoppable force meets the immovable object?",
"If we evolved from monkeys, why are there still monkeys?",
"What laws would you abolish if you could? What laws would you create?",
"If you could design a planet, what would your perfect planet look like?",
"If you had an animal or plant renamed in your honor, what would you want to carry your name? (the sd5k lore is about to go crazy)",
"If you could merge two games together and make a new one, what games would you choose and what would be the result?",
"If you had to be haunted by a ghost for the rest of your life, who would you choose as your ghost? (i fear I already know the answer to this)",
"If milo suddenly spoke one sentence and then never spoke again, what would be the most unsettling sentence he could say? (milo is about to drop a bar).",
"What would you try if you found out you were impervious to physical harm?- i'm cracking all of the bills at once, pig pile-style (the forbidden bar).",
"If animals could speak, what species would be good at which jobs?",
"If you had a pen with magical ink inside, what would happen when you wrote something? (BRO IS DOODLEBOB CONFIRMED).",
"What two animals would you like to switch the sounds they make? (milo is turning into an elephant)",
"If you could choose a nickname and have people call you it with complete seriousness, what would it be? (oh... wait) (how bro felt after typing that.",
"how much wood could a woodchuck chuck if a woodchuck could chuck wood (I'm not putting the dih version in here)",
"in your opinion, which is better: slow pace, or medium pace?",
"hypothetically speaking, how far does it stretch?",
"If you could live in a time loop one day, how'd you spend it knowing your actions wouldn't have consequences? (i even surprised myself with this one).",
"are my takes elite?",
"What is your favorite childhood memory?",
"What's something you think I should know about you that I don't yet?",
"What's your favorite memory that we've shared?",
"If money wasn't an object, what's at the top of your list for potential dates?",
"are you a tyrant? (the answer is yes)",
"how many children do you think we have (can you even keep track of them at this point?)",
"do you have any more crazy lore along the lines of the edit accounts (we're looking for ammunition with this one)",
"what is your favorite form of ragebait? (with the way you use it I'm asking you to pick a favorite child",
"6 or 7?",
"If you could put one word into any historical document, what word would you choose I'm putting <em>chud</em> into the declaration of independence?",
"Alexander Hamilton or Aaron Burr?",
"Keep one, destroy the other: jellycats and fugglers (this is a cruel question).",
"Gojo or Sukuna?",
"[eyestrain] this fanart is so very hot it makes me want to cry a pool of water to take me to the creator of this masterpiece and ask them to make more",
"guys guys!! jade tried to be creative, get the camera!!!",
"pretend this is a funny caption [repost]", 
"if you hate kaede, then like leave because i already hate you...",
"jade editing daddy... jade editing daddy!?",
"anyway, stan tohru or ill go all bark bark at you (THIS IS THE BEST DAY OF MY LIFE IM FRIED)",
"sigh, marry me now 😫 (these captions are genuinely making my life",
"what are some things on your bucket list?",
"room temperature water is superior (haa you thought it was gonna be a question)",
"ben or yolanda?",
"what's something you want us to do together that we haven't?",
"if you could only listen to one song for the rest of your life, what would it be?",
"if you had to make a speech using only slang terms, what would get your most frequent use?"





                                                                                                                                             













]

